============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape              Param #
============================================================================================================================================
SpeechRecognitionNet                     --                        --                        --                        --
├─Sequential: 1-1                        [8, 1, 64, 157]           [8, 2, 31, 77]            --                        --
│    └─Conv2d: 2-1                       [8, 1, 64, 157]           [8, 2, 62, 155]           [1, 2, 5, 5]              52
│    └─MaxPool2d: 2-2                    [8, 2, 62, 155]           [8, 2, 31, 77]            --                        --
│    └─ReLU: 2-3                         [8, 2, 31, 77]            [8, 2, 31, 77]            --                        --
├─Sequential: 1-2                        [8, 2, 31, 77]            [8, 4, 15, 38]            --                        --
│    └─Conv2d: 2-4                       [8, 2, 31, 77]            [8, 4, 31, 77]            [2, 4, 3, 3]              76
│    └─MaxPool2d: 2-5                    [8, 4, 31, 77]            [8, 4, 15, 38]            --                        --
│    └─ReLU: 2-6                         [8, 4, 15, 38]            [8, 4, 15, 38]            --                        --
├─Flatten: 1-3                           [8, 4, 15, 38]            [8, 2280]                 --                        --
├─Sequential: 1-4                        [8, 2280]                 [8, 1140]                 --                        --
│    └─Linear: 2-7                       [8, 2280]                 [8, 1140]                 [2280, 1140]              2,600,340
│    └─ReLU: 2-8                         [8, 1140]                 [8, 1140]                 --                        --
├─Sequential: 1-5                        [8, 1140]                 [8, 570]                  --                        --
│    └─Linear: 2-9                       [8, 1140]                 [8, 570]                  [1140, 570]               650,370
│    └─ReLU: 2-10                        [8, 570]                  [8, 570]                  --                        --
├─Sequential: 1-6                        [8, 570]                  [8, 2]                    --                        --
│    └─Linear: 2-11                      [8, 570]                  [8, 2]                    [570, 2]                  1,142
============================================================================================================================================
Total params: 3,251,980
Trainable params: 3,251,980
Non-trainable params: 0
Total mult-adds (M): 31.46
============================================================================================================================================
Input size (MB): 0.32
Forward/backward pass size (MB): 1.95
Params size (MB): 13.01
Estimated Total Size (MB): 15.28
============================================================================================================================================
