==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
SpeechRecognitionNet                     --                        --
├─Sequential: 1-1                        [8, 2, 32, 78]            --
│    └─Conv2d: 2-1                       [8, 2, 64, 157]           52
│    └─MaxPool2d: 2-2                    [8, 2, 32, 78]            --
│    └─ReLU: 2-3                         [8, 2, 32, 78]            --
├─Sequential: 1-2                        [8, 4, 16, 39]            --
│    └─Conv2d: 2-4                       [8, 4, 32, 78]            76
│    └─MaxPool2d: 2-5                    [8, 4, 16, 39]            --
│    └─ReLU: 2-6                         [8, 4, 16, 39]            --
├─Flatten: 1-3                           [8, 2496]                 --
├─Sequential: 1-4                        [8, 1248]                 --
│    └─Linear: 2-7                       [8, 1248]                 3,116,256
│    └─ReLU: 2-8                         [8, 1248]                 --
├─Sequential: 1-5                        [8, 624]                  --
│    └─Linear: 2-9                       [8, 624]                  779,376
│    └─ReLU: 2-10                        [8, 624]                  --
├─Sequential: 1-6                        [8, 2]                    --
│    └─Linear: 2-11                      [8, 2]                    1,250
==========================================================================================
Total params: 3,897,010
Trainable params: 3,897,010
Non-trainable params: 0
Total mult-adds (M): 36.87
==========================================================================================
Input size (MB): 0.32
Forward/backward pass size (MB): 2.05
Params size (MB): 15.59
Estimated Total Size (MB): 17.95
==========================================================================================
