============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape              Param #
============================================================================================================================================
SpeechRecognitionNet                     --                        --                        --                        --
├─Sequential: 1-1                        [24, 1, 64, 53]           [24, 2, 31, 25]           --                        --
│    └─Conv2d: 2-1                       [24, 1, 64, 53]           [24, 2, 62, 51]           [1, 2, 5, 5]              52
│    └─MaxPool2d: 2-2                    [24, 2, 62, 51]           [24, 2, 31, 25]           --                        --
│    └─ReLU: 2-3                         [24, 2, 31, 25]           [24, 2, 31, 25]           --                        --
├─Sequential: 1-2                        [24, 2, 31, 25]           [24, 4, 15, 12]           --                        --
│    └─Conv2d: 2-4                       [24, 2, 31, 25]           [24, 4, 31, 25]           [2, 4, 3, 3]              76
│    └─MaxPool2d: 2-5                    [24, 4, 31, 25]           [24, 4, 15, 12]           --                        --
│    └─ReLU: 2-6                         [24, 4, 15, 12]           [24, 4, 15, 12]           --                        --
├─Flatten: 1-3                           [24, 4, 15, 12]           [24, 720]                 --                        --
├─Sequential: 1-4                        [24, 720]                 [24, 360]                 --                        --
│    └─Linear: 2-7                       [24, 720]                 [24, 360]                 [720, 360]                259,560
│    └─ReLU: 2-8                         [24, 360]                 [24, 360]                 --                        --
├─Sequential: 1-5                        [24, 360]                 [24, 180]                 --                        --
│    └─Linear: 2-9                       [24, 360]                 [24, 180]                 [360, 180]                64,980
│    └─ReLU: 2-10                        [24, 180]                 [24, 180]                 --                        --
├─Sequential: 1-6                        [24, 180]                 [24, 2]                   --                        --
│    └─Linear: 2-11                      [24, 180]                 [24, 2]                   [180, 2]                  362
============================================================================================================================================
Total params: 325,030
Trainable params: 325,030
Non-trainable params: 0
Total mult-adds (M): 13.16
============================================================================================================================================
Input size (MB): 0.33
Forward/backward pass size (MB): 1.91
Params size (MB): 1.30
Estimated Total Size (MB): 3.54
============================================================================================================================================
